In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
matplotlib.style.use('ggplot')
%matplotlib inline

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.417073  0.053999 -1.568187  1.565113
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198
2013-01-05 -0.874286  2.326275  0.106209  0.000047
2013-01-06 -1.518433  0.666202 -0.929923 -0.171789

In [5]:
df.head()

                   A         B         C         D
2013-01-01 -0.417073  0.053999 -1.568187  1.565113
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198
2013-01-05 -0.874286  2.326275  0.106209  0.000047

In [6]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198
2013-01-05 -0.874286  2.326275  0.106209  0.000047
2013-01-06 -1.518433  0.666202 -0.929923 -0.171789

In [7]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [9]:
df.values

array([[ -4.17072676e-01,   5.39992788e-02,  -1.56818703e+00,
          1.56511306e+00],
       [  1.25442787e-01,   1.84694686e-01,   4.78408961e-01,
          3.36113361e-01],
       [  1.11460288e+00,  -3.85698718e-01,   1.11592473e-01,
         -3.82670326e-02],
       [ -1.08527603e+00,  -1.64892744e+00,   8.99667630e-01,
         -1.42197739e-01],
       [ -8.74285658e-01,   2.32627469e+00,   1.06209468e-01,
          4.68277530e-05],
       [ -1.51843306e+00,   6.66202464e-01,  -9.29922779e-01,
         -1.71789315e-01]])

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.442504  0.199424 -0.150372  0.258170
std    0.949211  1.305489  0.921988  0.665408
min   -1.518433 -1.648927 -1.568187 -0.171789
25%   -1.032528 -0.275774 -0.670890 -0.116215
50%   -0.645679  0.119347  0.108901 -0.019110
75%   -0.010186  0.545826  0.386705  0.252097
max    1.114603  2.326275  0.899668  1.565113

In [11]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.417073    0.125443    1.114603   -1.085276   -0.874286   -1.518433
B    0.053999    0.184695   -0.385699   -1.648927    2.326275    0.666202
C   -1.568187    0.478409    0.111592    0.899668    0.106209   -0.929923
D    1.565113    0.336113   -0.038267   -0.142198    0.000047   -0.171789

In [12]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.565113 -1.568187  0.053999 -0.417073
2013-01-02  0.336113  0.478409  0.184695  0.125443
2013-01-03 -0.038267  0.111592 -0.385699  1.114603
2013-01-04 -0.142198  0.899668 -1.648927 -1.085276
2013-01-05  0.000047  0.106209  2.326275 -0.874286
2013-01-06 -0.171789 -0.929923  0.666202 -1.518433

In [13]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198
2013-01-03  1.114603 -0.385699  0.111592 -0.038267
2013-01-01 -0.417073  0.053999 -1.568187  1.565113
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-06 -1.518433  0.666202 -0.929923 -0.171789
2013-01-05 -0.874286  2.326275  0.106209  0.000047

In [14]:
# selection
df['A']

2013-01-01   -0.417073
2013-01-02    0.125443
2013-01-03    1.114603
2013-01-04   -1.085276
2013-01-05   -0.874286
2013-01-06   -1.518433
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.417073  0.053999 -1.568187  1.565113
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267

In [16]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198

In [17]:
# selection by label
df.loc[dates[0]]

A   -0.417073
B    0.053999
C   -1.568187
D    1.565113
Name: 2013-01-01 00:00:00, dtype: float64

In [18]:
# selection on a multi-axis by label
df.loc[ : , ['A', 'B']]

                   A         B
2013-01-01 -0.417073  0.053999
2013-01-02  0.125443  0.184695
2013-01-03  1.114603 -0.385699
2013-01-04 -1.085276 -1.648927
2013-01-05 -0.874286  2.326275
2013-01-06 -1.518433  0.666202

In [19]:
# selection by position
df.iloc[3]

A   -1.085276
B   -1.648927
C    0.899668
D   -0.142198
Name: 2013-01-04 00:00:00, dtype: float64

In [20]:
df.iloc[3 : 5, 0 : 2]

                   A         B
2013-01-04 -1.085276 -1.648927
2013-01-05 -0.874286  2.326275

In [21]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.125443  0.478409
2013-01-03  1.114603  0.111592
2013-01-05 -0.874286  0.106209

In [22]:
# slicing rows
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267

In [23]:
# slicing columns
df.iloc[:,1:3]

                   B         C
2013-01-01  0.053999 -1.568187
2013-01-02  0.184695  0.478409
2013-01-03 -0.385699  0.111592
2013-01-04 -1.648927  0.899668
2013-01-05  2.326275  0.106209
2013-01-06  0.666202 -0.929923

In [24]:
# getting a value
df.iloc[1,1]

0.18469468587024759

In [25]:
# getting fast access to a scalar
df.iat[1,1]

0.18469468587024759

In [26]:
# boolean indexing
# using a single column's values to select data
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603 -0.385699  0.111592 -0.038267

In [27]:
# a where operation for getting
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.053999       NaN  1.565113
2013-01-02  0.125443  0.184695  0.478409  0.336113
2013-01-03  1.114603       NaN  0.111592       NaN
2013-01-04       NaN       NaN  0.899668       NaN
2013-01-05       NaN  2.326275  0.106209  0.000047
2013-01-06       NaN  0.666202       NaN       NaN

In [28]:
# using isin() method
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.417073  0.053999 -1.568187  1.565113    one
2013-01-02  0.125443  0.184695  0.478409  0.336113    one
2013-01-03  1.114603 -0.385699  0.111592 -0.038267    two
2013-01-04 -1.085276 -1.648927  0.899668 -0.142198  three
2013-01-05 -0.874286  2.326275  0.106209  0.000047   four
2013-01-06 -1.518433  0.666202 -0.929923 -0.171789  three

In [29]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.114603 -0.385699  0.111592 -0.038267   two
2013-01-05 -0.874286  2.326275  0.106209  0.000047  four

In [30]:
# setting
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [31]:
df['F'] = s1

In [32]:
# setting values by label
df.at[dates[0], 'A'] = 0

In [33]:
# setting values by position
df.iat[0,1] = 0

In [34]:
# setting by assigning with a numpy array
df.loc[:,'D'] = np.array([5] * len(df))

In [35]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.568187  5 NaN
2013-01-02  0.125443  0.184695  0.478409  5   1
2013-01-03  1.114603 -0.385699  0.111592  5   2
2013-01-04 -1.085276 -1.648927  0.899668  5   3
2013-01-05 -0.874286  2.326275  0.106209  5   4
2013-01-06 -1.518433  0.666202 -0.929923  5   5

In [36]:
# where operation with setting
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.568187 -5 NaN
2013-01-02 -0.125443 -0.184695 -0.478409 -5  -1
2013-01-03 -1.114603 -0.385699 -0.111592 -5  -2
2013-01-04 -1.085276 -1.648927 -0.899668 -5  -3
2013-01-05 -0.874286 -2.326275 -0.106209 -5  -4
2013-01-06 -1.518433 -0.666202 -0.929923 -5  -5

In [37]:
# missing data
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -1.568187  5 NaN   1
2013-01-02  0.125443  0.184695  0.478409  5   1   1
2013-01-03  1.114603 -0.385699  0.111592  5   2 NaN
2013-01-04 -1.085276 -1.648927  0.899668  5   3 NaN

In [38]:
# drop any row that has missing data
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02  0.125443  0.184695  0.478409  5  1  1

In [39]:
# filling missing data
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -1.568187  5  5  1
2013-01-02  0.125443  0.184695  0.478409  5  1  1
2013-01-03  1.114603 -0.385699  0.111592  5  2  5
2013-01-04 -1.085276 -1.648927  0.899668  5  3  5

In [40]:
# get boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [41]:
# operations
# stats
# performing a descriptive statistic
df.mean()

A   -0.372992
B    0.190424
C   -0.150372
D    5.000000
F    3.000000
dtype: float64

In [42]:
# same operation on the other axis
df.mean(1)

2013-01-01    0.857953
2013-01-02    1.357709
2013-01-03    1.568099
2013-01-04    1.233093
2013-01-05    2.111640
2013-01-06    1.643569
Freq: D, dtype: float64

In [43]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [44]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03  0.114603 -1.385699 -0.888408   4   1
2013-01-04 -4.085276 -4.648927 -2.100332   2   0
2013-01-05 -5.874286 -2.673725 -4.893791   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [45]:
# apply
# applying functions to data
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -1.568187   5 NaN
2013-01-02  0.125443  0.184695 -1.089778  10   1
2013-01-03  1.240046 -0.201004 -0.978186  15   3
2013-01-04  0.154770 -1.849931 -0.078518  20   6
2013-01-05 -0.719516  0.476343  0.027692  25  10
2013-01-06 -2.237949  1.142546 -0.902231  30  15

In [46]:
df.apply(lambda x: x.max() - x.min())

A    2.633036
B    3.975202
C    2.467855
D    0.000000
F    4.000000
dtype: float64

In [47]:
# histogramming
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    3
2    3
3    0
4    0
5    4
6    3
7    6
8    5
9    3
dtype: int32

In [48]:
# string methods
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
dtype: object

In [49]:
# merge
# concat
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  2.601395  0.308499  0.801298  0.995453
1  0.334152 -0.831343 -2.246649 -1.512406
2 -0.721885  1.500181  1.122248 -2.768534
3 -2.088286  0.888070 -0.926221  0.563859
4 -1.600382  0.240996  0.545859 -1.678377
5  0.297108  0.644827 -0.107490 -2.207686
6  0.048320  0.703743 -0.511296 -1.587712
7 -1.032334  0.424882  1.499877  0.366352
8  0.423265  2.811742  0.978505 -1.039921
9  0.106705 -0.007783 -0.391328 -0.528113

In [50]:
# break it into pieces
pieces = [df[:3],df[7:],df[3:7]]
pd.concat(pieces)

          0         1         2         3
0  2.601395  0.308499  0.801298  0.995453
1  0.334152 -0.831343 -2.246649 -1.512406
2 -0.721885  1.500181  1.122248 -2.768534
7 -1.032334  0.424882  1.499877  0.366352
8  0.423265  2.811742  0.978505 -1.039921
9  0.106705 -0.007783 -0.391328 -0.528113
3 -2.088286  0.888070 -0.926221  0.563859
4 -1.600382  0.240996  0.545859 -1.678377
5  0.297108  0.644827 -0.107490 -2.207686
6  0.048320  0.703743 -0.511296 -1.587712

In [51]:
# join
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})
left

   key  lval
0  foo     1
1  foo     2

In [52]:
right = pd.DataFrame({'key':['foo','foo'], 'lval':[4,5]})
right

   key  lval
0  foo     4
1  foo     5

In [53]:
pd.merge(left, right, on='key')

   key  lval_x  lval_y
0  foo       1       4
1  foo       1       5
2  foo       2       4
3  foo       2       5

In [54]:
# append
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  0.179655 -0.615834  0.616230 -1.339306
1  0.538632 -0.970619 -0.125731  0.326857
2 -0.796413  0.354459 -2.103089 -0.799673
3 -1.701604 -0.606524 -0.919919 -1.998457
4 -0.075026 -0.005947  1.443071  0.233596
5  0.349424 -0.469813 -1.401813  0.171427
6  0.185268  0.698255  0.943855 -1.739618
7 -0.619534  0.119898 -1.000797 -1.169341

In [55]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.179655 -0.615834  0.616230 -1.339306
1  0.538632 -0.970619 -0.125731  0.326857
2 -0.796413  0.354459 -2.103089 -0.799673
3 -1.701604 -0.606524 -0.919919 -1.998457
4 -0.075026 -0.005947  1.443071  0.233596
5  0.349424 -0.469813 -1.401813  0.171427
6  0.185268  0.698255  0.943855 -1.739618
7 -0.619534  0.119898 -1.000797 -1.169341
8 -1.701604 -0.606524 -0.919919 -1.998457

In [56]:
# grouping
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                       'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.376711 -1.205771
1  bar    one -1.070760  1.036992
2  foo    two -0.473312 -0.579509
3  bar  three  0.755530 -0.384260
4  foo    two -0.426686  0.373611
5  bar    two  1.777814  0.978406
6  foo    one -0.481627 -1.002280
7  foo  three  1.457178  0.030467

In [57]:
df.groupby('A').sum()

            C         D
A
bar  1.462585  1.631138
foo -0.301158 -2.383481

In [58]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.070760  1.036992
    three  0.755530 -0.384260
    two    1.777814  0.978406
foo one   -0.858338 -2.208051
    three  1.457178  0.030467
    two   -0.899998 -0.205898

In [59]:
# reshaping
# stack
tuples = list(zip(* [['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                    'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.485939  0.389496
      two    -2.074138 -0.184993
baz   one    -0.750273  1.349564
      two     2.450266  1.692780

In [60]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.485939
               B    0.389496
       two     A   -2.074138
               B   -0.184993
baz    one     A   -0.750273
               B    1.349564
       two     A    2.450266
               B    1.692780
dtype: float64

In [61]:
stacked.unstack()

                     A         B
first second
bar   one     0.485939  0.389496
      two    -2.074138 -0.184993
baz   one    -0.750273  1.349564
      two     2.450266  1.692780

In [62]:
stacked.unstack(1)

second        one       two
first
bar   A  0.485939 -2.074138
      B  0.389496 -0.184993
baz   A -0.750273  2.450266
      B  1.349564  1.692780

In [63]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.485939 -0.750273
       B  0.389496  1.349564
two    A -2.074138  2.450266
       B -0.184993  1.692780

In [64]:
# pivot table
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                  'B': ['A', 'B', 'C'] * 4,
                  'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                  'D': np.random.randn(12),
                  'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -2.143236  1.015426
1     one  B  foo  0.434329 -0.113894
2     two  C  foo  0.261853 -0.335265
3   three  A  bar -0.253590 -0.059377
4     one  B  bar -1.718487 -0.250832
5     one  C  bar -0.594683 -1.588674
6     two  A  foo  0.278439 -0.173293
7   three  B  foo  0.828813 -2.559144
8     one  C  foo  0.056889  0.232298
9     one  A  bar  0.950353  0.945389
10    two  B  bar -1.396418 -0.165514
11  three  C  bar  0.393735  0.369233

In [65]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.950353 -2.143236
      B -1.718487  0.434329
      C -0.594683  0.056889
three A -0.253590       NaN
      B       NaN  0.828813
      C  0.393735       NaN
two   A       NaN  0.278439
      B -1.396418       NaN
      C       NaN  0.261853

In [66]:
# time series
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [67]:
ts

2012-01-01 00:00:00     38
2012-01-01 00:00:01    499
2012-01-01 00:00:02    402
2012-01-01 00:00:03    387
2012-01-01 00:00:04     97
2012-01-01 00:00:05    110
2012-01-01 00:00:06    492
2012-01-01 00:00:07    231
2012-01-01 00:00:08    193
2012-01-01 00:00:09     97
2012-01-01 00:00:10    363
2012-01-01 00:00:11    467
2012-01-01 00:00:12     76
2012-01-01 00:00:13      9
2012-01-01 00:00:14    464
2012-01-01 00:00:15     40
2012-01-01 00:00:16    465
2012-01-01 00:00:17    156
2012-01-01 00:00:18    298
2012-01-01 00:00:19    342
2012-01-01 00:00:20    179
2012-01-01 00:00:21    407
2012-01-01 00:00:22    237
2012-01-01 00:00:23    480
2012-01-01 00:00:24     63
2012-01-01 00:00:25    306
2012-01-01 00:00:26    292
2012-01-01 00:00:27    142
2012-01-01 00:00:28    108
2012-01-01 00:00:29    446
                      ...
2012-01-01 00:01:10     10
2012-01-01 00:01:11     85
2012-01-01 00:01:12    241
2012-01-01 00:01:13    270
2012-01-01 00:01:14    378
2012-01-01 00:01:15    215
2012-01-01 00:01:16    296
2012-01-01 00:01:17    278
2012-01-01 00:01:18     62
2012-01-01 00:01:19    132
2012-01-01 00:01:20    279
2012-01-01 00:01:21    233
2012-01-01 00:01:22    409
2012-01-01 00:01:23    149
2012-01-01 00:01:24    235
2012-01-01 00:01:25     77
2012-01-01 00:01:26    456
2012-01-01 00:01:27    360
2012-01-01 00:01:28    211
2012-01-01 00:01:29    459
2012-01-01 00:01:30    294
2012-01-01 00:01:31    210
2012-01-01 00:01:32     89
2012-01-01 00:01:33    384
2012-01-01 00:01:34    124
2012-01-01 00:01:35     64
2012-01-01 00:01:36    246
2012-01-01 00:01:37    454
2012-01-01 00:01:38     58
2012-01-01 00:01:39      7
Freq: S, dtype: int32

In [68]:
ts.resample('5Min', how='sum')

2012-01-01    22796
Freq: 5T, dtype: int32

In [69]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-01-01 00:00:00+00:00     38
2012-01-01 00:00:01+00:00    499
2012-01-01 00:00:02+00:00    402
2012-01-01 00:00:03+00:00    387
2012-01-01 00:00:04+00:00     97
2012-01-01 00:00:05+00:00    110
2012-01-01 00:00:06+00:00    492
2012-01-01 00:00:07+00:00    231
2012-01-01 00:00:08+00:00    193
2012-01-01 00:00:09+00:00     97
2012-01-01 00:00:10+00:00    363
2012-01-01 00:00:11+00:00    467
2012-01-01 00:00:12+00:00     76
2012-01-01 00:00:13+00:00      9
2012-01-01 00:00:14+00:00    464
2012-01-01 00:00:15+00:00     40
2012-01-01 00:00:16+00:00    465
2012-01-01 00:00:17+00:00    156
2012-01-01 00:00:18+00:00    298
2012-01-01 00:00:19+00:00    342
2012-01-01 00:00:20+00:00    179
2012-01-01 00:00:21+00:00    407
2012-01-01 00:00:22+00:00    237
2012-01-01 00:00:23+00:00    480
2012-01-01 00:00:24+00:00     63
2012-01-01 00:00:25+00:00    306
2012-01-01 00:00:26+00:00    292
2012-01-01 00:00:27+00:00    142
2012-01-01 00:00:28+00:00    108
2012-01-01 00:00:29+00:00    446
                            ...
2012-01-01 00:01:10+00:00     10
2012-01-01 00:01:11+00:00     85
2012-01-01 00:01:12+00:00    241
2012-01-01 00:01:13+00:00    270
2012-01-01 00:01:14+00:00    378
2012-01-01 00:01:15+00:00    215
2012-01-01 00:01:16+00:00    296
2012-01-01 00:01:17+00:00    278
2012-01-01 00:01:18+00:00     62
2012-01-01 00:01:19+00:00    132
2012-01-01 00:01:20+00:00    279
2012-01-01 00:01:21+00:00    233
2012-01-01 00:01:22+00:00    409
2012-01-01 00:01:23+00:00    149
2012-01-01 00:01:24+00:00    235
2012-01-01 00:01:25+00:00     77
2012-01-01 00:01:26+00:00    456
2012-01-01 00:01:27+00:00    360
2012-01-01 00:01:28+00:00    211
2012-01-01 00:01:29+00:00    459
2012-01-01 00:01:30+00:00    294
2012-01-01 00:01:31+00:00    210
2012-01-01 00:01:32+00:00     89
2012-01-01 00:01:33+00:00    384
2012-01-01 00:01:34+00:00    124
2012-01-01 00:01:35+00:00     64
2012-01-01 00:01:36+00:00    246
2012-01-01 00:01:37+00:00    454
2012-01-01 00:01:38+00:00     58
2012-01-01 00:01:39+00:00      7
Freq: S, dtype: int32

In [70]:
ts_utc.tz_convert('US/Eastern')

2011-12-31 19:00:00-05:00     38
2011-12-31 19:00:01-05:00    499
2011-12-31 19:00:02-05:00    402
2011-12-31 19:00:03-05:00    387
2011-12-31 19:00:04-05:00     97
2011-12-31 19:00:05-05:00    110
2011-12-31 19:00:06-05:00    492
2011-12-31 19:00:07-05:00    231
2011-12-31 19:00:08-05:00    193
2011-12-31 19:00:09-05:00     97
2011-12-31 19:00:10-05:00    363
2011-12-31 19:00:11-05:00    467
2011-12-31 19:00:12-05:00     76
2011-12-31 19:00:13-05:00      9
2011-12-31 19:00:14-05:00    464
2011-12-31 19:00:15-05:00     40
2011-12-31 19:00:16-05:00    465
2011-12-31 19:00:17-05:00    156
2011-12-31 19:00:18-05:00    298
2011-12-31 19:00:19-05:00    342
2011-12-31 19:00:20-05:00    179
2011-12-31 19:00:21-05:00    407
2011-12-31 19:00:22-05:00    237
2011-12-31 19:00:23-05:00    480
2011-12-31 19:00:24-05:00     63
2011-12-31 19:00:25-05:00    306
2011-12-31 19:00:26-05:00    292
2011-12-31 19:00:27-05:00    142
2011-12-31 19:00:28-05:00    108
2011-12-31 19:00:29-05:00    446
                            ...
2011-12-31 19:01:10-05:00     10
2011-12-31 19:01:11-05:00     85
2011-12-31 19:01:12-05:00    241
2011-12-31 19:01:13-05:00    270
2011-12-31 19:01:14-05:00    378
2011-12-31 19:01:15-05:00    215
2011-12-31 19:01:16-05:00    296
2011-12-31 19:01:17-05:00    278
2011-12-31 19:01:18-05:00     62
2011-12-31 19:01:19-05:00    132
2011-12-31 19:01:20-05:00    279
2011-12-31 19:01:21-05:00    233
2011-12-31 19:01:22-05:00    409
2011-12-31 19:01:23-05:00    149
2011-12-31 19:01:24-05:00    235
2011-12-31 19:01:25-05:00     77
2011-12-31 19:01:26-05:00    456
2011-12-31 19:01:27-05:00    360
2011-12-31 19:01:28-05:00    211
2011-12-31 19:01:29-05:00    459
2011-12-31 19:01:30-05:00    294
2011-12-31 19:01:31-05:00    210
2011-12-31 19:01:32-05:00     89
2011-12-31 19:01:33-05:00    384
2011-12-31 19:01:34-05:00    124
2011-12-31 19:01:35-05:00     64
2011-12-31 19:01:36-05:00    246
2011-12-31 19:01:37-05:00    454
2011-12-31 19:01:38-05:00     58
2011-12-31 19:01:39-05:00      7
Freq: S, dtype: int32

In [71]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -1.394645
2012-02-29    3.085277
2012-03-31    1.694066
2012-04-30    0.277749
2012-05-31    1.011143
Freq: M, dtype: float64

In [72]:
ps = ts.to_period()
ps

2012-01   -1.394645
2012-02    3.085277
2012-03    1.694066
2012-04    0.277749
2012-05    1.011143
Freq: M, dtype: float64

In [73]:
ps.to_timestamp()

2012-01-01   -1.394645
2012-02-01    3.085277
2012-03-01    1.694066
2012-04-01    0.277749
2012-05-01    1.011143
Freq: MS, dtype: float64

In [74]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    0.265898
1990-06-01 09:00   -1.371727
1990-09-01 09:00   -0.390948
1990-12-01 09:00   -1.140357
1991-03-01 09:00    1.086318
Freq: H, dtype: float64

In [75]:
# categoricals
df = pd.DataFrame({'id': [1,2,3,4,5,6], 'raw_grade': ['a', 'b', 'b', 'a', 'a', 'e']})
df['grade'] = df['raw_grade'].astype('category')
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [76]:
df['grade'].cat.categories = ['very good', 'good', 'very bad']

In [77]:
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [78]:
df['grade'] = df['grade'].cat.set_categories(['very bad', 'bad', 'medium', 'good', 'very good'])
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [79]:
# sorting is per order  in the categories, not lexical order
df.sort_values(by='grade')

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [80]:
df.groupby('grade').size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [81]:
# plotting
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot();

In [82]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])
df = df.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best');